avr-rust/avrd/packs/atmega/ATmega16U4.atdf
        <module name="USART">
          <instance name="USART1" caption="USART">
            <register-group name="USART1" name-in-module="USART1" offset="0x00" address-space="data" caption="USART"/>
            <signals>
              <signal group="TXD" function="default" pad="PD3"/>
              <signal group="RXD" function="default" pad="PD2"/>
              <signal group="XCK" function="default" pad="PD5"/>
              <signal group="RTS" function="default" pad="PB7"/>
              <signal group="CTS" function="default" pad="PD5"/>
            </signals>
          </instance>
        </module>
        <module name="BOOT_LOAD">
          <instance name="BOOT_LOAD" caption="Bootloader">
            <register-group name="BOOT_LOAD" name-in-module="BOOT_LOAD" offset="0x00" address-space="data" caption="Bootloader"/>
            <signals>
              <signal group="HWB" function="default" pad="PE2"/>
            </signals>
          </instance>
        </module>
        <module name="EEPROM">
          <instance name="EEPROM" caption="EEPROM">
            <register-group name="EEPROM" name-in-module="EEPROM" offset="0x00" address-space="data" caption="EEPROM"/>
          </instance>
        </module>
        <module name="TC8">
          <instance name="TC0" caption="Timer/Counter, 8-bit">
            <register-group name="TC0" name-in-module="TC0" offset="0x00" address-space="data" caption="Timer/Counter, 8-bit"/>
            <signals>
              <signal group="T" function="default" pad="PD7"/>
              <signal group="OCB" function="default" pad="PD0"/>
              <signal group="OCA" function="default" pad="PB7"/>
            </signals>
          </instance>
        </module>
        <module name="TC16">
          <instance name="TC1" caption="Timer/Counter, 16-bit">
            <register-group name="TC1" name-in-module="TC1" offset="0x00" address-space="data" caption="Timer/Counter, 16-bit"/>
            <signals>
              <signal group="T" function="default" pad="PD6"/>
              <signal group="ICP" function="default" pad="PD4"/>
              <signal group="OCA" function="default" pad="PB5"/>
              <signal group="OCB" function="default" pad="PB6"/>
              <signal group="OCC" function="default" pad="PB7"/>
            </signals>
          </instance>
          <instance name="TC3" caption="Timer/Counter, 16-bit">
            <register-group name="TC3" name-in-module="TC3" offset="0x00" address-space="data" caption="Timer/Counter, 16-bit"/>
            <signals>
              <signal group="ICP" function="default" pad="PC7"/>
              <signal group="OCA" function="default" pad="PC6"/>
            </signals>
          </instance>
        </module>
        <module name="TC10">
          <instance name="TC4" caption="Timer/Counter, 10-bit">
            <register-group name="TC4" name-in-module="TC4" offset="0x00" address-space="data" caption="Timer/Counter, 10-bit"/>
            <signals>
              <signal group="_OCA" function="default" pad="PC6"/>
              <signal group="OCA" function="default" pad="PC7"/>
              <signal group="_OCB" function="default" pad="PB5"/>
              <signal group="OCB" function="default" pad="PB6"/>
              <signal group="_OCD" function="default" pad="PD6"/>
              <signal group="OCD" function="default" pad="PD7"/>
            </signals>
          </instance>
        </module>
        <module name="JTAG">
          <instance name="JTAG" caption="JTAG Interface">
            <register-group name="JTAG" name-in-module="JTAG" offset="0x00" address-space="data" caption="JTAG Interface"/>
            <signals>
              <signal group="TCK" function="default" pad="PF4"/>
              <signal group="TMS" function="default" pad="PF5"/>
              <signal group="TDO" function="default" pad="PF6"/>
              <signal group="TDI" function="default" pad="PF7"/>
            </signals>
          </instance>
        </module>
        <module name="EXINT">
          <instance name="EXINT" caption="External Interrupts">
            <register-group name="EXINT" name-in-module="EXINT" offset="0x00" address-space="data" caption="External Interrupts"/>
            <signals>
              <signal group="PCINT" index="0" function="default" pad="PB0"/>
              <signal group="PCINT" index="1" function="default" pad="PB1"/>
              <signal group="PCINT" index="2" function="default" pad="PB2"/>
              <signal group="PCINT" index="3" function="default" pad="PB3"/>
              <signal group="PCINT" index="4" function="default" pad="PB4"/>
              <signal group="PCINT" index="5" function="default" pad="PB5"/>
              <signal group="PCINT" index="6" function="default" pad="PB6"/>
              <signal group="PCINT" index="7" function="default" pad="PB7"/>
              <signal group="INT" index="0" function="default" pad="PD0"/>
              <signal group="INT" index="1" function="default" pad="PD1"/>
              <signal group="INT" index="2" function="default" pad="PD2"/>
              <signal group="INT" index="3" function="default" pad="PD3"/>
              <signal group="INT" index="6" function="default" pad="PE6"/>
            </signals>
          </instance>
        </module>
        <module name="TWI">
          <instance name="TWI" caption="Two Wire Serial Interface">
            <register-group name="TWI" name-in-module="TWI" offset="0x00" address-space="data" caption="Two Wire Serial Interface"/>
            <signals>
              <signal group="SDA" function="default" pad="PD1"/>
              <signal group="SCL" function="default" pad="PD0"/>
            </signals>
          </instance>
        </module>
        <module name="ADC">
          <instance name="ADC" caption="Analog-to-Digital Converter">
            <register-group name="ADC" name-in-module="ADC" offset="0x00" address-space="data" caption="Analog-to-Digital Converter"/>
            <signals>
              <signal group="ADC" index="0" function="default" pad="PF0"/>
              <signal group="ADC" index="1" function="default" pad="PF1"/>
              <signal group="ADC" index="4" function="default" pad="PF4"/>
              <signal group="ADC" index="5" function="default" pad="PF5"/>
              <signal group="ADC" index="6" function="default" pad="PF6"/>
              <signal group="ADC" index="7" function="default" pad="PF7"/>
              <signal group="ADC" index="8" function="default" pad="PD4"/>
              <signal group="ADC" index="9" function="default" pad="PD6"/>
              <signal group="ADC" index="10" function="default" pad="PD7"/>
              <signal group="ADC" index="11" function="default" pad="PB4"/>
              <signal group="ADC" index="12" function="default" pad="PB5"/>
              <signal group="ADC" index="13" function="default" pad="PB6"/>
            </signals>
          </instance>
        </module>
        <module name="AC">
          <instance name="AC" caption="Analog Comparator">
            <register-group name="AC" name-in-module="AC" offset="0x00" address-space="data" caption="Analog Comparator"/>
            <signals>
              <signal group="AIN" index="0" function="default" pad="PE6"/>
            </signals>
          </instance>
        </module>
