avr-rust/avrd/packs/atmega/ATmega16U4.atdf
        <register caption="Timer/Counter 4 Control Register C" name="TCCR4C" offset="0xC2" size="1">
          <bitfield caption="Comparator A Output Mode" mask="0x80" name="COM4A1S"/>
          <bitfield caption="Comparator A Output Mode" mask="0x40" name="COM4A0S"/>
          <bitfield caption="Comparator B Output Mode" mask="0x20" name="COM4B1S"/>
          <bitfield caption="Comparator B Output Mode" mask="0x10" name="COM4B0S"/>
          <bitfield caption="Comparator D Output Mode" mask="0x0C" name="COM4D"/>
          <bitfield caption="Force Output Compare Match 4D" mask="0x02" name="FOC4D"/>
          <bitfield caption="Pulse Width Modulator D Enable" mask="0x01" name="PWM4D"/>
        </register>
        <register caption="Timer/Counter 4 Control Register D" name="TCCR4D" offset="0xC3" size="1">
          <bitfield caption="Fault Protection Interrupt Enable" mask="0x80" name="FPIE4"/>
          <bitfield caption="Fault Protection Mode Enable" mask="0x40" name="FPEN4"/>
          <bitfield caption="Fault Protection Noise Canceler" mask="0x20" name="FPNC4"/>
          <bitfield caption="Fault Protection Edge Select" mask="0x10" name="FPES4"/>
          <bitfield caption="Fault Protection Analog Comparator Enable" mask="0x08" name="FPAC4"/>
          <bitfield caption="Fault Protection Interrupt Flag" mask="0x04" name="FPF4"/>
          <bitfield caption="Waveform Generation Mode bits" mask="0x03" name="WGM4"/>
        </register>
        <register caption="Timer/Counter 4 Control Register E" name="TCCR4E" offset="0xC4" size="1">
          <bitfield caption="Register Update Lock" mask="0x80" name="TLOCK4"/>
          <bitfield caption="Enhanced Compare/PWM Mode" mask="0x40" name="ENHC4"/>
          <bitfield caption="Output Compare Override Enable bit" mask="0x3F" name="OC4OE"/>
        </register>
        <register caption="Timer/Counter4 Low Bytes" name="TCNT4" offset="0xBE" size="1" mask="0xFF">
          <bitfield caption="Timer/Counter4 bits" mask="0xFF" name="TC4"/>
        </register>
        <register caption="Timer/Counter4" name="TC4H" offset="0xBF" size="1" mask="0x07">
          <bitfield caption="Timer/Counter4 bits" mask="0x07" name="TC4" lsb="8"/>
        </register>
        <register caption="Timer/Counter4 Output Compare Register A" name="OCR4A" offset="0xCF" size="1" mask="0xFF">
          <bitfield caption="Timer/Counter4 Output Compare A bits" mask="0xFF" name="OCR4A"/>
        </register>
        <register caption="Timer/Counter4 Output Compare Register B" name="OCR4B" offset="0xD0" size="1" mask="0xFF">
          <bitfield caption="Timer/Counter4 Output Compare B bits" mask="0xFF" name="OCR4B"/>
        </register>
        <register caption="Timer/Counter4 Output Compare Register C" name="OCR4C" offset="0xD1" size="1" mask="0xFF">
          <bitfield caption="Timer/Counter4 Output Compare C bits" mask="0xFF" name="OCR4C"/>
        </register>
        <register caption="Timer/Counter4 Output Compare Register D" name="OCR4D" offset="0xD2" size="1" mask="0xFF">
          <bitfield caption="Timer/Counter4 Output Compare D bits" mask="0xFF" name="OCR4D"/>
        </register>
        <register caption="Timer/Counter4 Interrupt Mask Register" name="TIMSK4" offset="0x72" size="1">
          <bitfield caption="Timer/Counter4 Output Compare D Match Interrupt Enable" mask="0x80" name="OCIE4D"/>
          <bitfield caption="Timer/Counter4 Output Compare A Match Interrupt Enable" mask="0x40" name="OCIE4A"/>
          <bitfield caption="Timer/Counter4 Output Compare B Match Interrupt Enable" mask="0x20" name="OCIE4B"/>
          <bitfield caption="Timer/Counter4 Overflow Interrupt Enable" mask="0x04" name="TOIE4"/>
        </register>
        <register caption="Timer/Counter4 Interrupt Flag register" name="TIFR4" offset="0x39" size="1" ocd-rw="R">
          <bitfield caption="Output Compare Flag 4D" mask="0x80" name="OCF4D"/>
          <bitfield caption="Output Compare Flag 4A" mask="0x40" name="OCF4A"/>
          <bitfield caption="Output Compare Flag 4B" mask="0x20" name="OCF4B"/>
          <bitfield caption="Timer/Counter4 Overflow Flag" mask="0x04" name="TOV4"/>
        </register>
        <register caption="Timer/Counter 4 Dead Time Value" name="DT4" offset="0xD4" size="1">
          <bitfield caption="Timer/Counter 4 Dead Time Value Bits" mask="0xFF" name="DT4L"/>
        </register>
      </register-group>
    </module>
    <module caption="Timer/Counter, 16-bit" name="TC16">
      <register-group caption="Timer/Counter, 16-bit" name="TC3">
        <register caption="Timer/Counter3 Control Register A" name="TCCR3A" offset="0x90" size="1">
          <bitfield caption="Compare Output Mode 1A, bits" mask="0xC0" name="COM3A"/>
          <bitfield caption="Compare Output Mode 3B, bits" mask="0x30" name="COM3B"/>
          <bitfield caption="Compare Output Mode 3C, bits" mask="0x0C" name="COM3C"/>
          <bitfield caption="Waveform Generation Mode" mask="0x03" name="WGM3"/>
        </register>
        <register caption="Timer/Counter3 Control Register B" name="TCCR3B" offset="0x91" size="1">
          <bitfield caption="Input Capture 3 Noise Canceler" mask="0x80" name="ICNC3"/>
          <bitfield caption="Input Capture 3 Edge Select" mask="0x40" name="ICES3"/>
          <bitfield caption="Waveform Generation Mode" mask="0x18" name="WGM3" lsb="2"/>
          <bitfield caption="Prescaler source of Timer/Counter 3" mask="0x07" name="CS3" values="CLK_SEL_3BIT_EXT"/>
        </register>
        <register caption="Timer/Counter 3 Control Register C" name="TCCR3C" offset="0x92" size="1">
          <bitfield caption="Force Output Compare 3A" mask="0x80" name="FOC3A"/>
          <bitfield caption="Force Output Compare 3B" mask="0x40" name="FOC3B"/>
          <bitfield caption="Force Output Compare 3C" mask="0x20" name="FOC3C"/>
        </register>
        <register caption="Timer/Counter3 Bytes" name="TCNT3" offset="0x94" size="2" mask="0xFFFF">
          <bitfield caption="Timer/Counter3 bits" mask="0xFFFF" name="TCNT3"/>
        </register>
