avr-rust/avrd/packs/atmega/ATmega16U4.atdf
        <register caption="" name="UEBCLX" offset="0xF2" size="1" mask="0xFF" ocd-rw="R">
          <bitfield caption="Byte count bits" mask="0xFF" name="BYCT"/>
        </register>
        <register caption="" name="UEDATX" offset="0xF1" size="1" ocd-rw="">
          <bitfield caption="" mask="0xFF" name="DAT"/>
        </register>
        <register caption="" name="UEIENX" offset="0xF0" size="1">
          <bitfield caption="" mask="0x80" name="FLERRE"/>
          <bitfield caption="" mask="0x40" name="NAKINE"/>
          <bitfield caption="" mask="0x10" name="NAKOUTE"/>
          <bitfield caption="" mask="0x08" name="RXSTPE"/>
          <bitfield caption="" mask="0x04" name="RXOUTE"/>
          <bitfield caption="" mask="0x02" name="STALLEDE"/>
          <bitfield caption="" mask="0x01" name="TXINE"/>
        </register>
        <register caption="" name="UESTA1X" offset="0xEF" size="1" ocd-rw="R">
          <bitfield caption="" mask="0x04" name="CTRLDIR"/>
          <bitfield caption="" mask="0x03" name="CURRBK"/>
        </register>
        <register caption="" name="UESTA0X" offset="0xEE" size="1">
          <bitfield caption="" mask="0x80" name="CFGOK"/>
          <bitfield caption="" mask="0x40" name="OVERFI"/>
          <bitfield caption="" mask="0x20" name="UNDERFI"/>
          <bitfield caption="" mask="0x0C" name="DTSEQ"/>
          <bitfield caption="" mask="0x03" name="NBUSYBK"/>
        </register>
        <register caption="" name="UECFG1X" offset="0xED" size="1">
          <bitfield caption="" mask="0x70" name="EPSIZE"/>
          <bitfield caption="" mask="0x0C" name="EPBK"/>
          <bitfield caption="" mask="0x02" name="ALLOC"/>
        </register>
        <register caption="" name="UECFG0X" offset="0xEC" size="1">
          <bitfield caption="" mask="0xC0" name="EPTYPE"/>
          <bitfield caption="" mask="0x01" name="EPDIR"/>
        </register>
        <register caption="" name="UECONX" offset="0xEB" size="1">
          <bitfield caption="" mask="0x20" name="STALLRQ"/>
          <bitfield caption="" mask="0x10" name="STALLRQC"/>
          <bitfield caption="" mask="0x08" name="RSTDT"/>
          <bitfield caption="" mask="0x01" name="EPEN"/>
        </register>
        <register caption="" name="UERST" offset="0xEA" size="1">
          <bitfield caption="" mask="0x7F" name="EPRST"/>
        </register>
        <register caption="" name="UENUM" offset="0xE9" size="1" mask="0x07">
          <bitfield caption="" mask="0x07" name="UENUM"/>
        </register>
        <register caption="" name="UEINTX" offset="0xE8" size="1">
          <bitfield caption="" mask="0x80" name="FIFOCON"/>
          <bitfield caption="" mask="0x40" name="NAKINI"/>
          <bitfield caption="" mask="0x20" name="RWAL"/>
          <bitfield caption="" mask="0x10" name="NAKOUTI"/>
          <bitfield caption="" mask="0x08" name="RXSTPI"/>
          <bitfield caption="" mask="0x04" name="RXOUTI"/>
          <bitfield caption="" mask="0x02" name="STALLEDI"/>
          <bitfield caption="" mask="0x01" name="TXINI"/>
        </register>
        <register caption="" name="UDMFN" offset="0xE6" size="1" ocd-rw="R">
          <bitfield caption="" mask="0x10" name="FNCERR"/>
        </register>
        <register caption="" name="UDFNUM" offset="0xE4" size="2" mask="0x07FF">
          <bitfield caption="Frame number value" mask="0x07FF" name="FNUM"/>
        </register>
        <register caption="" name="UDADDR" offset="0xE3" size="1">
          <bitfield caption="" mask="0x80" name="ADDEN"/>
          <bitfield caption="" mask="0x7F" name="UADD"/>
        </register>
        <register caption="" name="UDIEN" offset="0xE2" size="1">
          <bitfield caption="" mask="0x40" name="UPRSME"/>
          <bitfield caption="" mask="0x20" name="EORSME"/>
          <bitfield caption="" mask="0x10" name="WAKEUPE"/>
          <bitfield caption="" mask="0x08" name="EORSTE"/>
          <bitfield caption="" mask="0x04" name="SOFE"/>
          <bitfield caption="" mask="0x01" name="SUSPE"/>
        </register>
        <register caption="" name="UDINT" offset="0xE1" size="1">
          <bitfield caption="" mask="0x40" name="UPRSMI"/>
          <bitfield caption="" mask="0x20" name="EORSMI"/>
          <bitfield caption="" mask="0x10" name="WAKEUPI"/>
          <bitfield caption="" mask="0x08" name="EORSTI"/>
          <bitfield caption="" mask="0x04" name="SOFI"/>
          <bitfield caption="" mask="0x01" name="SUSPI"/>
        </register>
        <register caption="" name="UDCON" offset="0xE0" size="1">
          <bitfield caption="USB low speed mode" mask="0x04" name="LSM"/>
          <bitfield caption="" mask="0x08" name="RSTCPU"/>
          <bitfield caption="" mask="0x02" name="RMWKUP"/>
          <bitfield caption="" mask="0x01" name="DETACH"/>
        </register>
        <register caption="USB General Control Register" name="USBCON" offset="0xD8" size="1">
          <bitfield caption="" mask="0x80" name="USBE"/>
          <bitfield caption="" mask="0x20" name="FRZCLK"/>
          <bitfield caption="" mask="0x10" name="OTGPADE"/>
          <bitfield caption="" mask="0x01" name="VBUSTE"/>
        </register>
        <register caption="" name="USBINT" offset="0xDA" size="1">
          <bitfield caption="" mask="0x01" name="VBUSTI"/>
        </register>
        <register caption="" name="USBSTA" offset="0xD9" size="1" ocd-rw="R">
          <bitfield caption="" mask="0x08" name="SPEED"/>
          <bitfield caption="" mask="0x01" name="VBUS"/>
        </register>
        <register caption="" name="UHWCON" offset="0xD7" size="1">
          <bitfield caption="" mask="0x01" name="UVREGE"/>
        </register>
      </register-group>
    </module>
  </modules>
  <pinouts>
    <pinout name="TQFP44" caption="TQFP44">
      <pin position="1" pad="PE6"/>
      <pin position="2" pad="UVCC"/>
      <pin position="3" pad="DM"/>
      <pin position="4" pad="DP"/>
      <pin position="5" pad="UGND"/>
      <pin position="6" pad="UCAP"/>
      <pin position="7" pad="VBUS"/>
      <pin position="8" pad="PB0"/>
      <pin position="9" pad="PB1"/>
      <pin position="10" pad="PB2"/>
      <pin position="11" pad="PB3"/>
      <pin position="12" pad="PB7"/>
      <pin position="13" pad="RESET"/>
      <pin position="14" pad="VCC"/>
      <pin position="15" pad="GND"/>
      <pin position="16" pad="XTAL2"/>
      <pin position="17" pad="XTAL1"/>
      <pin position="18" pad="PD0"/>
      <pin position="19" pad="PD1"/>
      <pin position="20" pad="PD2"/>
      <pin position="21" pad="PD3"/>
      <pin position="22" pad="PD5"/>
      <pin position="23" pad="GND"/>
      <pin position="24" pad="AVCC"/>
      <pin position="25" pad="PD4"/>
      <pin position="26" pad="PD6"/>
      <pin position="27" pad="PD7"/>
      <pin position="28" pad="PB4"/>
      <pin position="29" pad="PB5"/>
      <pin position="30" pad="PB6"/>
      <pin position="31" pad="PC6"/>
      <pin position="32" pad="PC7"/>
      <pin position="33" pad="PE2"/>
      <pin position="34" pad="VCC"/>
      <pin position="35" pad="GND"/>
      <pin position="36" pad="PF7"/>
      <pin position="37" pad="PF6"/>
      <pin position="38" pad="PF5"/>
      <pin position="39" pad="PF4"/>
      <pin position="40" pad="PF1"/>
      <pin position="41" pad="PF0"/>
      <pin position="42" pad="AREF"/>
      <pin position="43" pad="GND"/>
      <pin position="44" pad="AVCC"/>
    </pinout>
    <pinout name="QFN44" caption="QFN44">
      <pin position="1" pad="PE6"/>
      <pin position="2" pad="UVCC"/>
      <pin position="3" pad="DM"/>
      <pin position="4" pad="DP"/>
      <pin position="5" pad="UGND"/>
      <pin position="6" pad="UCAP"/>
      <pin position="7" pad="VBUS"/>
      <pin position="8" pad="PB0"/>
      <pin position="9" pad="PB1"/>
      <pin position="10" pad="PB2"/>
      <pin position="11" pad="PB3"/>
      <pin position="12" pad="PB7"/>
      <pin position="13" pad="RESET"/>
      <pin position="14" pad="VCC"/>
      <pin position="15" pad="GND"/>
      <pin position="16" pad="XTAL2"/>
      <pin position="17" pad="XTAL1"/>
      <pin position="18" pad="PD0"/>
      <pin position="19" pad="PD1"/>
      <pin position="20" pad="PD2"/>
      <pin position="21" pad="PD3"/>
      <pin position="22" pad="PD5"/>
      <pin position="23" pad="GND"/>
      <pin position="24" pad="AVCC"/>
      <pin position="25" pad="PD4"/>
      <pin position="26" pad="PD6"/>
      <pin position="27" pad="PD7"/>
      <pin position="28" pad="PB4"/>
      <pin position="29" pad="PB5"/>
      <pin position="30" pad="PB6"/>
      <pin position="31" pad="PC6"/>
      <pin position="32" pad="PC7"/>
      <pin position="33" pad="PE2"/>
      <pin position="34" pad="VCC"/>
      <pin position="35" pad="GND"/>
      <pin position="36" pad="PF7"/>
      <pin position="37" pad="PF6"/>
      <pin position="38" pad="PF5"/>
      <pin position="39" pad="PF4"/>
      <pin position="40" pad="PF1"/>
      <pin position="41" pad="PF0"/>
      <pin position="42" pad="AREF"/>
      <pin position="43" pad="GND"/>
      <pin position="44" pad="AVCC"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>
